---
type: ReinforcementRoundingManager
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 5
tags: [revit-api, class]
---

# ReinforcementRoundingManager

`Autodesk.Revit.DB.Structure.ReinforcementRoundingManager` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetLengthUnitTypeId | 2014 | `public ForgeTypeId GetLengthUnitTypeId ()` |
| Property | Element | 2014 | `public Element Element { get ; }` |
| Property | IsActiveOnElement | 2014 | `public bool IsActiveOnElement { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |